consult-web-async.org
**** consult-notes-org-roam
#+begin_src emacs-lisp
(when consult-notes-org-roam-mode
  (cl-loop for source in '(consult-notes-org-roam--refs consult-notes-org-roam--nodes)
           do (consult-web--make-source-from-consult-source source
                                                            :category 'file
                                                            :type 'sync
                                                            :face 'consult-web-notes-source-face
                                                            :search-history 'consult-web--search-history
                                                            :selection-history 'consult-web--selection-history
                                                            :on-preview #'consult-web--org-roam-note-preview
                                                            :on-return #'identity
                                                            :on-callback #'consult-web--org-roam-note-callback

                                                            :preview-key 'consult-preview-key
                                                            :dynamic 'both
                                                            :group #'consult-web--group-function
                                                            :annotate nil
                                                            )))
#+end_src

**** provide and footer
#+begin_src emacs-lisp
;;; provide `consult-web-consult-notes' module

(provide 'consult-web-consult-notes)

(add-to-list 'consult-web-sources-modules-to-load 'consult-web-consult-notes)
;;; consult-web-consult-notes.el ends here
#+end_src



*** consult-gh
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :link yes :tangle ./sources/consult-web-gh.el
:END:
**** header

#+begin_src emacs-lisp
;;; consult-web-gh.el --- Consulting Github Client -*- lexical-binding: t -*-

;; Copyright (C) 2024 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2024
;; Version: 0.1
;; Package-Requires: ((emacs "28.1") (consult "1.1"))
;; Homepage: https://github.com/armindarvish/consult-web
;; Keywords: convenience

;;; Commentary:

;;; Code:

(require 'consult-web)
(require 'consult-gh)
#+end_src
**** builder
#+begin_src emacs-lisp
(cl-defun consult-web--gh-search-repos-builder (input &rest args &key callback &allow-other-keys)
  "makes builder command line args for “GitHub CLI”.
"
  (pcase-let* ((`(,query . ,opts) (consult-web--split-command input))
               (opts (car-safe opts))
               (count (plist-get opts :count))
               (count (or (and (integerp count) count)
                          (and count (string-to-number (format "%s" count)))
                          consult-web-default-count))
               (cmd (consult--build-args '("gh" "search" "repos")))
               (cmd-opts (list "--limit" (format "%s" count)))
               (`(,re . ,hl) (funcall consult--regexp-compiler query 'basic t)))
      (when re
        (cons (append cmd
                      (list (string-join re " "))
                      cmd-opts)
              hl))))
#+end_src
**** preview
#+begin_src emacs-lisp
(defun consult-web--gh-preview (cand)
  (when-let ((info (text-properties-at 0 (cdr (get-text-property 0 'multi-category cand))))
             (repo (plist-get info :repo))
             (query (plist-get info :query))
             (match-str (consult--build-args query))
             (buffer (get-buffer-create consult-gh-preview-buffer-name)))
    (add-to-list 'consult-gh--preview-buffers-list buffer)
    (consult-gh--repo-view (format "%s" repo) buffer)
    (with-current-buffer buffer
      (if consult-gh-highlight-matches
          (cond
           ((listp match-str)
            (mapcar (lambda (item)
                      (highlight-regexp item 'consult-gh-preview-match-face)) match-str))
           ((stringp match-str)
            (highlight-regexp match-str 'consult-gh-preview-match-face))
           )))
    (funcall (consult--buffer-preview) 'preview
             buffer
             )
    ))
#+end_src
**** return
#+begin_src emacs-lisp
(defun consult-web--gh-callback (cand)
  (funcall consult-gh-repo-action (cons cand (text-properties-at 0 (cdr (get-text-property 0 'multi-category cand))))))

#+end_src
**** consult-gh source
#+begin_src emacs-lisp
(consult-web-define-source "GitHub"
                           :narrow-char ?G
                           :type 'async
                           :category 'consult-gh-repos
                           :face 'consult-web-engine-source-face
                           :request #'consult-web--gh-search-repos-builder
                           :on-preview #'consult-web--gh-preview
                           :on-return #'identity
                           :on-callback #'consult-web--gh-callback
                           :preview-key consult-web-preview-key
                           :search-history 'consult-web--search-history
                           :selection-history 'consult-web--selection-history
                           :group #'consult-web--group-function
                           :sort t
                           :dynamic 'both
                           :transform (lambda (items &optional query) (mapcar (lambda (string)
                                                                (consult-gh--repo-format string (or query "") t)) items))
                           :annotate nil
                           )
#+end_src

**** provide and footer
#+begin_src emacs-lisp
;;; provide `consult-web-gh' module

(provide 'consult-web-gh)

(add-to-list 'consult-web-sources-modules-to-load 'consult-web-gh)
;;; consult-web-gh.el ends here
#+end_src


*** consult-grep
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :link yes :tangle ./sources/consult-web-grep.el
:END:
**** header
#+begin_src emacs-lisp
;;; consult-web-grep.el --- Consulting Grep Command -*- lexical-binding: t -*-

;; Copyright (C) 2024 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2024
;; Version: 0.1
;; Package-Requires: ((emacs "28.1") (consult "1.1"))
;; Homepage: https://github.com/armindarvish/consult-web
;; Keywords: convenience

;;; Commentary:

;;; Code:

(require 'consult-web)
#+end_src

**** grep-builder
#+begin_src emacs-lisp
(defun consult-web--grep-make-builder (make-builder &optional dir)
(pcase-let* ((`(_ ,paths ,dir) (consult--directory-prompt "" dir))
             (paths (if dir
                        (mapcar (lambda (path) (file-truename (concat dir path))) paths)
                      paths))
             )
(funcall make-builder paths)
))
#+end_src



**** transform
#+begin_src emacs-lisp
(defun consult-web--grep-transform (candidates &optional query)
(let* ((frame-width-percent (floor (* (frame-width) 0.1)))
      (file "")
      (file-len 0)
      (file-str "")
      result)
          (save-match-data
            (dolist (str candidates)
              (when (and (string-match consult--grep-match-regexp str)
                         ;; Filter out empty context lines
                         (or (/= (aref str (match-beginning 3)) ?-)
                             (/= (match-end 0) (length str))))
                ;; We share the file name across candidates to reduce
                ;; the amount of allocated memory.
                (unless (and (= file-len (- (match-end 1) (match-beginning 1)))
                             (eq t (compare-strings
                                    file 0 file-len
                                    str (match-beginning 1) (match-end 1) nil)))
                  (setq file (file-relative-name (match-string 1 str) (buffer-file-name)))
                  (when (and file (stringp file) (> file-len (* frame-width-percent 2)))
                    (setq file (consult-web--set-string-width file (* frame-width-percent 2) (* frame-width-percent 1))))
                  (setq file-len (length file))

                  )
                (let* ((line (propertize (match-string 2 str) 'face 'consult-line-number))
                       (ctx (= (aref str (match-beginning 3)) ?-))
                       (sep (if ctx "-" ":"))
                       (content (substring str (match-end 0)))
                       (line-len (length line)))
                  (when (length> content consult-grep-max-columns)
                    ;; (setq content (substring content 0 consult-grep-max-columns))
                    (setq content  (consult-web--set-string-width content consult-grep-max-columns))
                    )
                  (setq str (concat file sep line sep content))
                  ;; Store file name in order to avoid allocations in `consult--prefix-group'
                  (add-text-properties 0 file-len `(face consult-file consult--prefix-group ,file) str)
                  ;; (put-text-property (1+ file-len) (+ 1 file-len line-len) 'face 'consult-line-number str)
                  (when ctx
                    (add-face-text-property (+ 2 file-len line-len) (length str) 'consult-grep-context 'append str))
                  (push (propertize str :source "grep" :title query) result)))))
          result))
#+end_src



**** preview
#+begin_src emacs-lisp

(defun consult-web--grep-preview (cand)
  "Grep preview function."
(funcall  (consult--jump-state) 'preview (consult--grep-position (cdr (get-text-property 0 'multi-category cand))))
  )

#+end_src

**** callback
#+begin_src emacs-lisp
(defun consult-web--grep-callback (cand)
  "Grep preview function."
(funcall  (consult--jump-state) 'return (consult--grep-position (cdr (get-text-property 0 'multi-category cand))))
  )
#+end_src

**** consult-web-grep-builder
#+begin_src emacs-lisp
(cl-defun consult-web--grep-builder (input &rest args &key callback &allow-other-keys)
  "makes builder command line args for “grep”.
"
  (pcase-let* ((`(,query . ,opts) (consult-web--split-command input))
               (opts (car-safe opts))
               (count (plist-get opts :count))
               (dir (plist-get opts :dir))
               (dir (if dir (file-truename (format "%s" dir))))
               (count (or (and (integerp count) count)
                          (and count (string-to-number (format "%s" count)))
                          consult-web-default-count))
               (default-directory (or dir default-directory))
               )
   (funcall (consult-web--grep-make-builder #'consult--grep-make-builder dir) query)
            ))
#+end_src


**** source
#+begin_src emacs-lisp
(consult-web-define-source "grep"
                           :narrow-char ?r
                           :type 'async
                           :face 'consult-web-engine-source-face
                           :request #'consult-web--grep-builder
                           :transform #'consult-web--grep-transform
                           :on-preview #'consult-web--grep-preview
                           :on-return #'identity
                           :on-callback #'consult-web--grep-callback
                           :preview-key consult-web-preview-key
                           :search-history 'consult-web--search-history
                           :selection-history 'consult-web--selection-history
                           :group #'consult-web--group-function
                           ;; :group #'consult--prefix-group
                           :sort t
                           :dynamic 'both
                           :transform #'consult-web--ripgrep-transform
                           :annotate nil
                           )
#+end_src

**** provide and footer
#+begin_src emacs-lisp
;;; provide `consult-web-grep' module

(provide 'consult-web-grep)

(add-to-list 'consult-web-sources-modules-to-load 'consult-web-grep)
;;; consult-web-grep.el ends here
#+end_src


*** notes
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :link yes :tangle ./sources/consult-web-notes.el
:END:
**** header
#+begin_src emacs-lisp
;;; consult-web-notes.el --- Consulting Note Files -*- lexical-binding: t -*-

;; Copyright (C) 2024 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2024
;; Version: 0.1
;; Package-Requires: ((emacs "28.1") (consult "1.1"))
;; Homepage: https://github.com/armindarvish/consult-web
;; Keywords: convenience

;;; Commentary:

;;; Code:

(require 'consult-web)
(require 'consult-web-grep)
#+end_src

