sources/consult-web-consult-notes.el

(when consult-notes-org-roam-mode
  (cl-loop for source in '(consult-notes-org-roam--refs consult-notes-org-roam--nodes)
           do (consult-web--make-source-from-consult-source source
                                                            :category 'file
                                                            :type 'sync
                                                            :face 'consult-web-notes-source-face
                                                            :search-history 'consult-web--search-history
                                                            :selection-history 'consult-web--selection-history
                                                            :on-preview #'consult-web--org-roam-note-preview
                                                            :on-return #'identity
                                                            :on-callback #'consult-web--org-roam-note-callback

                                                            :preview-key 'consult-preview-key
                                                            :static 'both
                                                            :group #'consult-web--group-function
                                                            :annotate nil
                                                            )))

;;; provide `consult-web-consult-notes' module

(provide 'consult-web-consult-notes)

(add-to-list 'consult-web-sources-modules-to-load 'consult-web-consult-notes)
;;; consult-web-consult-notes.el ends here
