consult-web-async.org
**** invidious
#+begin_src emacs-lisp
(cl-defun consult-web--invidious-fetch-results (input &rest args &key callback &allow-other-keys)
  "Fetches search results for INPUT from “Google custom search” service."
  (pcase-let* ((`(,query . ,opts) (consult-web--split-command input))
               (opts (car-safe opts))
               (count (plist-get opts :count))
               (page (plist-get opts :page))
               (type (plist-get opts :type))
               (order (or (plist-get opts :order) (plist-get opts :sort)))
               (channel (or (plist-get opts :channel) (plist-get opts :user)))
               (subs (or (plist-get opts :subs) (plist-get opts :subscriptions)))
               (searchdate (plist-get opts :date))
               (searchdate (if searchdate (format "%s" searchdate)))
               (features (plist-get opts :features))
               (features (if features (format "%s" features)))
               (duration (plist-get opts :dur))
               (duration (if duration (format "%s" duration)))
               (count (or (and (integerp count) count)
                          (and count (string-to-number (format "%s" count)))
                          consult-web-default-count))
               (page (or (and (integerp page) page)
                         (and page (string-to-number (format "%s" page)))
                         consult-web-default-count))
               (count (min count 10))
               (page (+ (* page count) 1))
               (order  (if (and order (member (format "%s" order) '("date" "rating" "relevance" "upload_date" "views" "view_count"))) (format "%s" order) "relevance"))
               (type (if (and type (member (format "%s" type) '("channel" "playlist" "video" "movie" "show" "all"))) (format "%s" type) "video"))
               (params (delq nil `(("q" . ,(replace-regexp-in-string " " "+" query))
                         ("sort_by" . ,order)
                         ("type" . ,type)
                         ,(when searchdate `("date" . ,searchdate))
                         ,(when features `("features" . ,features))
                         ,(when duration `("duration" . ,duration))
                         ,(when subs `("subscriptions" . ,(if subs "true" "false"))))))
               (server-url (car (consult-web--invidious-get-servers)))
               (api-url (concat server-url "/api/v1/search?")))
    (consult-web--fetch-url api-url consult-web-http-retrieve-backend
                            :encoding 'utf-8
                            :params params
                            :parser #'consult-web--json-parse-buffer
                            :callback
                            (lambda (attrs)
                              (let* ((raw-results attrs)
                                     (annotated-results
                                      (mapcar (lambda (item)
                                                (let*
                                                    ((source "Invidious")
                                                     (item-type (gethash "type" item))
                                                     (channelhandle (gethash "channelHandle" item))
                                                     (title (or (gethash "title" item)
                                                                (unless (eq channelhandle :null) channelhandle)
                                                                (gethash "author" item)
                                                                ))
                                                     (videos  (gethash "videos" item))
                                                     (videoid (or (gethash "videoId" item)
                                                                  (and videos (gethash "videoId" (car videos)))))
                                                     (channeltitle (gethash "author" item))
                                                     (channelid (gethash "authorId" item))
                                                     (playlistid (gethash "playlistId" item))
                                                     (videocount (gethash "videoCount" item))
                                                     (subcount (gethash "subCount" item))
                                                     (viewcount (gethash "viewCount" item))
                                                     (videolength (gethash "lengthSeconds" item))
                                                     (date (gethash "published" item))
                                                     (date (when date (format-time-string "%Y-%m-%d" (seconds-to-time date))))
                                                     (url (cond
                                                           ((and playlistid videoid) (consult-web--make-url-string consult-web-youtube-watch-url `(("v" . ,videoid)
                               ("list" . ,playlistid))))
                                                           (playlistid (consult-web--make-url-string consult-web-youtube-watch-url `(("list" . ,playlistid))))
                                                           (videoid (consult-web--make-url-string consult-web-youtube-watch-url `(("v" . ,videoid))))

                                                           (channelid (concat consult-web-youtube-channel-url channelid))))
                                                     (search-url (consult-web--make-url-string server-url params))
                                                     (description (gethash "description" item))

                                                     (decorated (consult-web--invidious-format-candidate :source source :type item-type :query query :title title :snippet description :channeltitle channeltitle :date date :subcount subcount :videocount videocount :viewcount viewcount :length videolength)))
                                                (propertize decorated
                                                            :source source
                                                            :title title
                                                            :url url
                                                            :search-url search-url
                                                            :query query
                                                            :snippet description
                                                            :videoid videoid
                                                            :channeltitle channeltitle
                                                            :channelid channelid
                                                            :duration duration
:views viewcount
:videocount videocount
:subscriptions subcount)))

                                      raw-results)))
                              (when annotated-results
                                (funcall callback annotated-results))
                              annotated-results)
                              ))))

(consult-web-define-source "Invidious"
                           :narrow-char ?I
                           :type 'dynamic
                           :category 'consult-web-video
                           :face 'consult-web-engine-source-face
                           :request #'consult-web--invidious-fetch-results
                           :preview-key consult-web-preview-key
                           :search-history 'consult-web--search-history
                           :selection-history 'consult-web--selection-history
                           :enabled (lambda () (bound-and-true-p consult-web-invidious-server-url))
                           :group #'consult-web--group-function
                           :sort t
                           :dynamic 'both
                           :annotate nil
                           )
#+end_src

**** provide and footer
#+begin_src emacs-lisp
;;; provide `consult-web-invidious' module

(provide 'consult-web-invidious)

(add-to-list 'consult-web-sources-modules-to-load 'consult-web-invidious)
;;; consult-web-invidious.el ends here
#+end_src


*** PubMed
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :link yes :tangle ./sources/consult-web-pubmed.el
:END:
**** header
#+begin_src emacs-lisp
;;; consult-web-pubmed.el --- Consulting PubMed -*- lexical-binding: t -*-

;; Copyright (C) 2024 Armin Darvish

;; Author: Armin Darvish
;; Maintainer: Armin Darvish
;; Created: 2024
;; Version: 0.1
;; Package-Requires: ((emacs "28.1") (consult "1.1"))
;; Homepage: https://github.com/armindarvish/consult-web
;; Keywords: convenience

;;; Commentary:

;;; Code:

(require 'consult-web)
#+end_src

**** entrez utils api
***** key
#+begin_src emacs-lisp
(defcustom consult-web-pubmed-api-key nil
  "Key for Pubmed Entrez API.

See URL `https://www.ncbi.nlm.nih.gov/books/NBK25501/' for more info"
  :group 'consult-web
  :type '(choice (const :tag "API Key" string)
                 (function :tag "Custom Function")))
#+end_src
***** esearch
#+begin_src emacs-lisp
(defvar consult-web-pubmed-search-url "https://pubmed.ncbi.nlm.nih.gov/")

(defvar  consult-web-pubmed-esearch-api-url "https://eutils.ncbi.nlm.nih.gov/entrez/eutils/esearch.fcgi")


(cl-defun consult-web--pubmed-esearch-fetch-results (input &rest args &key db &allow-other-keys)
  "Fetches “esearch” results for INPUT from PubMed Entrez Utilities service.

DB is passed as db in query parameters. (This is the databes to search.)

Refer to URL `https://www.ncbi.nlm.nih.gov/books/NBK25501/'
for more info."

  (pcase-let* ((`(,query . ,opts) (consult-web--split-command input))
               (opts (car-safe opts))
               (count (plist-get opts :count))
               (page (plist-get opts :page))
               (count (or (and (integerp count) count)
                          (and count (string-to-number (format "%s" count)))
                          consult-web-default-count))
               (page (or (and (integerp page) page)
                         (and page (string-to-number (format "%s" page)))
                         consult-web-default-page))
               (count (min count 20))
               (page (* page count))
               (db (if db (format "%s" db) "pubmed"))
               (params `(("db" . ,db)
                         ("term" . ,(replace-regexp-in-string " " "+" query))
                         ("usehistory" . "y")
                         ("retmax" . ,(format "%s" count))
                         ("retstart" . ,(format "%s" page))
                         ("retmode" . "json")
                         ))
               (headers `(("tool" . "consult-web")
                          ("email" . "contact@armindarvish.com")
                          ("api_key" . ,(consult-web-expand-variable-function consult-web-pubmed-api-key)))))
    (consult-web--fetch-url
     consult-web-pubmed-esearch-api-url consult-web-http-retrieve-backend
     :sync t
     :params params
     :headers headers
     :parser #'consult-web--json-parse-buffer
     :callback
     (lambda (attrs)
       (let* ((results (gethash "esearchresult" attrs))
              (webenv (gethash "webenv" results))
              (qk (gethash "querykey" results))
              (idlist (gethash "idlist" results)))
         `(:webenv ,webenv :qk ,qk :idlist ,idlist)
         )))
    ))


#+end_src
